Autodesk.Revit.DB.ExportIFCCategoryKey.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportIFCCategoryKey.CustomSubCategoryId
The Revit custom subcategory id.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.ExportIFCCategoryKey.SubCategoryName
The Revit subcategrory name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.ExportIFCCategoryKey.CategoryName
The Revit category name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.ExportIFCCategoryKey.#ctor(System.String,System.String,Autodesk.Revit.DB.CustomSubCategoryId)
Constructs a new ExportIFCCategoryKey with category, subcategory names and special id.
categoryName:
The Revit category name.
subCategoryName:
The Revit subcategory name.
customSubCategoryId:
The Revit custom subcategory id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.ExportIFCCategoryKey.#ctor
Constructs a new ExportIFCCategoryKey with default values.
Since:
2025

Autodesk.Revit.DB.ExportIFCCategoryKey
Represents a Revit category item stored in a template.
Since:
2025